OpenFOAM-Wing-Mesh-Refinement-Study-main/OpenFOAM-Wing-Mesh-Refinement-Study-main/Mesh_Refinement/initial_test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -20);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -20);
    }

    outlet
    {
        type            zeroGradient;
    }


    side
    {
        type            slip;
    }

    wing
    {
        type            noSlip;
    }

}


// ************************************************************************* //
